# language:ru
@AddComment
Функционал: Добавление комментария к записи
  Пользователь должен зайти на сайт
  Пользователь должен перейти на страницу с записью и добавить комментарий (API и UI)
  Пользователь должен выйти из системы

  Сценарий: Добавление комментария к записи
    Дано открыть сайт Jira
    Когда пользователь входит в систему
    Тогда открывается страница "System Dashboard"

    # Добавление комментария через API
    Тогда отправляется запрос на добавления комментария

    # Добавление комментария через UI
    Когда пользователь нажимает на навигационную панель на Issue
    И пользователь нажимает на Reported By Me
    Тогда пользователь на странице "Reported by me"
    Когда пользовать выбирает запись по ключу
    И пользователь нажимает на кнопку Comment
    Тогда пользователь печатает комментарий "This comment has been added through the UI."
    И пользовать нажимает на кнопку Add
    Тогда проверяется добавленный комментарий

    И пользователь выходит из системы