# language:ru
@CreateIssue
Функционал: Создание записи
  Пользователь должен зайти на сайт
  Пользователь должен создать 2 записи (API и UI)
  Пользователь должен выйти из системы

  Сценарий: Создание записи
    Дано открыть сайт Jira
    Когда пользователь входит в систему
    Тогда открывается страница "System Dashboard"

    # Проверка через Status Code + ключ записывается в файл
    Тогда создаётся запись через API

    # Создание записи через UI
    Когда пользователь нажимает на кнопку Create
    Тогда открывается вкладка "Create Issue"
    Когда пользователь в блоке Project печатает "MAXOAT (MAX)"
    И пользователь в блоке Issue Type печатает "Story"
    И пользователь в блоке Summary печатает название записи
    И пользователь нажимает на ссылку Assiqn to me
    И пользователь нажимает на кнопку создания записи
    Тогда проверяется созданная запись

    И пользователь выходит из системы