# language:ru
  @DeleteIssue
  Функционал: Удаление записи
    Пользователь должен зайти на сайт
    Пользователь должен удалить 2 записи (API и UI)
    Пользователь должен выйти из системы

    Сценарий: Удаление записи через API и UI
      Дано открыть сайт Jira
      Когда пользователь входит в систему
      Тогда открывается страница "System Dashboard"

      # Удаление (созданной через API) записи: API
      Тогда отправляется запрос на удаление записи

      # Удаление записи через UI
      Когда пользователь нажимает на навигационную панель на Issue
      И пользователь нажимает на Reported By Me
      Тогда пользователь на странице "Reported by me"
      Когда пользователь выбирает созданную ранее запись
      И пользователь нажимает на кнопку More
      И пользователь нажимает на кнопку Delete
      Тогда появляется окно "Delete Issue"
      И пользователь удаляет запись
      Тогда проверяется удаление записи

      И пользователь выходит из системы