# language:ru
@GetComment
Функционал: Получение комментарии записи
  Пользователь должен авторизоваться
  Пользователь должен отправить запрос на получение информации о комментарии
  Пользователь должен зайти на страницу с выбранной записью и получить информацию о комментариях

  Сценарий: Получение комментарии записи
    Дано открыть сайт Jira
    Когда пользователь входит в систему
    Тогда открывается страница "System Dashboard"

  # Через API
    Тогда отправляется запрос на получение комментариев записи через API

    # Получени информации о комментариях (Key = MAXOAT-568)
    Когда пользователь нажимает на навигационную панель на Issue
    И пользователь нажимает на Reported By Me
    Тогда пользователь на странице "Reported by me"
    Когда пользователь выбирает свою запись через ключ
    И пользователь записывает информацию о комментариях в "InfoAboutIssueCommentsUI.txt"

    И пользователь выходит из системы