# language:ru
@GetIssue
Функционал: Получение информации о записи
  Пользователь должен зайти на сайт
  Пользователь должен перейти на страницу записи и получить данные о записи
  Пользователь должен выйти из системы

  Сценарий: Получение информации о записи
    Дано открыть сайт Jira
    Когда пользователь входит в систему
    Тогда открывается страница "System Dashboard"

    # Получение информации через API (Key = MAXOAT-569)
    Тогда отправляется запрос на получение информации о записи

    # Получение информации (Key = MAXOAT-568)
    Когда пользователь нажимает на навигационную панель на Issue
    И пользователь нажимает на Reported By Me
    Тогда пользователь на странице "Reported by me"
    Когда пользователь выбирает свою запись через ключ
    И пользователь записывает информацию о записи в "InfoAboutIssueUI.txt"

    И пользователь выходит из системы