# language:ru
@UpdateIssue
Функционал: Обновление записи
  Пользователь должен зайти на сайт
  Пользователь должен перейти на страницу записи и отредактировать её (API и UI)
  Пользователь должен выйти из системы

  Сценарий: Обновление записи
    Дано открыть сайт Jira
    Когда пользователь входит в систему
    Тогда открывается страница "System Dashboard"

    # Обновление информации через API (TEST_ISSUE_API)
    Тогда обновляется запись через API

    # Обновление информации
    Когда пользователь нажимает на навигационную панель на Issue
    И пользователь нажимает на Reported By Me
    Тогда пользователь на странице "Reported by me"
    Когда пользователь выбирает свою запись через ключ
    И пользователь нажимает на кнопку Edit
    Тогда открывается окно Edit Issue
    И пользователь в блоке Summary печатает "Change Summary with UI"
    И пользователь в блоке Priority печатает "Low"
    И пользователь нажимает на кнопку Update
    Тогда проверяется изменение записи

    И пользователь выходит из системы